---
kind: property
id: P:Autodesk.Revit.UI.UIControlledApplication.IsLateAddinLoading
source: html/05cbbed6-c213-b589-3024-52be90e70ca2.htm
---
# Autodesk.Revit.UI.UIControlledApplication.IsLateAddinLoading Property

Indicates whether this add-in is loaded on the fly or not. If it is loaded when Revit is starting up, it
is false, otherwise it should be true.

## Syntax (C#)
```csharp
public bool IsLateAddinLoading { get; }
```